# 常量
"""
    程序在运行的过程中，值永远不会发生改变的量称为常量；
    一般使用大写表示常量。
"""
# 圆周率： PI = 3.1415926
# 标识符
"""
    标识符就是程序员定义的变量名、函数名，需要有顾名思义，见名知意的效果。
    可以由字母、下划线、和数字组成，但不能由数字开头；
    不能和关键字重名。
"""
# 关键字
"""
    关键字就是Python内部已经使用的标识符；
    关键字具有特殊的功能和含义；
    开发者不允许定义和关键字相同名字的标识符。
"""
# 命名规则
"""
    命名规则可以认为是一种惯例，并非绝对与强制；
    目的：增加代码的识别和可读性。
    变量常用命名规则：（两个单词以上时）
        1、下划线：
            每个单词都是小写；
            单词间用 _ 连接。如 first_name
        2、驼峰法：
            小驼峰：第一个单词首字母小写，后续每个单词首字母大写：如firstName；
            大驼峰：每个单词的首字母都大写；如：FirstName。
"""